Revit 2027 API
RebarBendingDetail.ResetTagRelativePosition Method
 Resets the embedded tag position w.r.t. the realistic bending detail element to the selected tag position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void ResetTagRelativePosition(
	Element bendingDetail
)
Public Shared Sub ResetTagRelativePosition (
	bendingDetail As Element
)
public:
static void ResetTagRelativePosition(
	Element^ bendingDetail
)
static member ResetTagRelativePosition :
        bendingDetail : Element -> unit
Parameters
bendingDetail Element
 The bending detail element.
Exceptions
Exception | Condition
ArgumentException |  This option is only available for realistic bending detail elements.
ArgumentNullException |  A non-optional argument was null
Remarks
 This function is exclusive to realistic bending detail mode.
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace